Repository: Kuuuzya/ZenNewsChannelRSS
Catalog: languages/zen-news-channel-rss-*.po
Languages: ru_ru

source: Zen RSS Settings
ru_ru: Настройки Zen RSS

source: Security check failed
ru_ru: Ошибка проверки безопасности

source: Unauthorized
ru_ru: Нет доступа

source: Cache cleared successfully!
ru_ru: Кэш успешно очищен!

source: Settings saved successfully!
ru_ru: Настройки сохранены!

source: RSS Feed Links
ru_ru: Ссылки на RSS-ленты

source: Zen News Feed
ru_ru: Лента Дзен Новостей

source: Zen Channel Feed
ru_ru: Лента Дзен Канала

source: General Settings
ru_ru: Общие настройки

source: News Feed Slug
ru_ru: URL для ленты Новостей

source: URL path for News feed (e.g., "zen-news" → /feed/zen-news)
ru_ru: Путь для ленты Новостей (например, "zen-news" → /feed/zen-news)

source: Channel Feed Slug
ru_ru: URL для ленты Канала

source: URL path for Channel feed (e.g., "zen-channel" → /feed/zen-channel)
ru_ru: Путь для ленты Канала (например, "zen-channel" → /feed/zen-channel)

source: Cache Duration
ru_ru: Длительность кэширования

source: minutes
ru_ru: минут

source: How long to cache feed output (1-1440 minutes)
ru_ru: Сколько минут хранить кэш ленты (1-1440 минут)

source: Clear Cache Now
ru_ru: Очистить кэш сейчас

source: News Feed Settings
ru_ru: Настройки ленты Новостей

source: Number of Posts
ru_ru: Количество записей

source: Maximum 500 items (Zen requirement)
ru_ru: Максимум 500 записей (требование Дзена)

source: Maximum Age (Days)
ru_ru: Максимальный возраст (дней)

source: Only include posts from last N days (maximum 8 for News)
ru_ru: Включать записи только за последние N дней (максимум 8 для Новостей)

source: Logo URL
ru_ru: URL логотипа

source: Optional logo for the feed
ru_ru: Необязательный логотип для ленты

source: Include Thumbnails
ru_ru: Включить миниатюры

source: Add image enclosure tags (JPEG format, OG image priority)
ru_ru: Добавить теги изображений (формат JPEG, приоритет OG image)

source: Remove Teaser
ru_ru: Удалить тизер

source: Remove first paragraph from full-text content
ru_ru: Удалить первый абзац из полнотекстового контента

source: Remove Shortcodes
ru_ru: Удалить шорткоды

source: Strip all WordPress shortcodes from content
ru_ru: Удалить все WordPress шорткоды из контента

source: Channel Feed Settings
ru_ru: Настройки ленты Канала

source: Recommended: at least 10 posts for initial setup
ru_ru: Рекомендуется: минимум 10 записей для начальной настройки

source: Recommended: 2-3 days for fresh content
ru_ru: Рекомендуется: 2-3 дня для свежего контента

source: Full Content
ru_ru: Полный контент

source: Generate content:encoded with full article HTML (images converted to JPEG)
ru_ru: Генерировать content:encoded с полным HTML статьи (изображения конвертируются в JPEG)

source: Related Posts Block
ru_ru: Блок "Ещё по теме"

source: Insert "Related Posts" links into content
ru_ru: Вставить ссылки "Ещё по теме" в контент

source: Related Posts Position
ru_ru: Позиция блока "Ещё по теме"

source: After which paragraph to insert related posts (1-10)
ru_ru: После какого абзаца вставить похожие записи (1-10)

source: Save Settings
ru_ru: Сохранить настройки

source: Cache for all feeds cleared successfully!
ru_ru: Кэш всех лент успешно очищен!

source: News feed cache cleared successfully!
ru_ru: Кэш ленты новостей успешно очищен!

source: Channel feed cache cleared successfully!
ru_ru: Кэш ленты канала успешно очищен!

source: Settings saved successfully! Remember to clear the cache to see changes.
ru_ru: Настройки сохранены! Не забудьте очистить кэш, чтобы увидеть изменения.

source: News Feed Settings (Zen News)
ru_ru: Настройки ленты новостей (Дзен Новости)

source: Channel Feed Settings (Zen Channel)
ru_ru: Настройки ленты канала (Дзен Канал)

source: Clear All Cache
ru_ru: Очистить весь кэш

source: Clear News Cache
ru_ru: Очистить кэш новостей

source: Clear Channel Cache
ru_ru: Очистить кэш канала

source: View News Feed
ru_ru: Открыть ленту новостей

source: View Channel Feed
ru_ru: Открыть ленту канала

source: Full URL: %s
ru_ru: Полный URL: %s

source: How long to cache RSS feeds before regenerating (0-1440 minutes / 24 hours).
ru_ru: Как долго хранить кэш RSS-лент перед регенерацией (0-1440 минут / 24 часа).

source: Set to 0 to disable caching completely.
ru_ru: Установите 0, чтобы полностью отключить кэширование.

source: Recommended: 15-60 minutes for most sites. Caching improves performance and reduces server load.
ru_ru: Рекомендуется: 15-60 минут для большинства сайтов. Кэширование улучшает производительность и снижает нагрузку на сервер.

source: Configuration for Yandex Zen News feed. This feed follows strict Zen News requirements (8-day limit, JPEG images, clean text).
ru_ru: Настройка ленты для Яндекс.Новости (Дзен). Эта лента соответствует строгим требованиям (лимит 8 дней, JPEG изображения, чистый текст).

source: Configuration for Yandex Zen Channel feed. Includes full HTML content with automatic JPEG conversion, figure cleanup, and "Source" attribution.
ru_ru: Настройка ленты для Яндекс.Дзен Каналов. Включает полный HTML контент с автоматической конвертацией в JPEG, очисткой figure и атрибуцией "Источника".

source: How many posts to include in the News feed (1-500).
ru_ru: Сколько записей включить в ленту новостей (1-500).

source: Zen requirement: Maximum 500 items.
ru_ru: Требование Дзена: Максимум 500 элементов.

source: Recommended: 30-50 posts.
ru_ru: Рекомендуется: 30-50 записей.

source: Only include posts from the last N days (1-8).
ru_ru: Включать записи только за последние N дней (1-8).

source: Zen News requirement: Maximum 8 days.
ru_ru: Требование Дзен Новостей: Максимум 8 дней.

source: Recommended: 3 days for fresh news content.
ru_ru: Рекомендуется: 3 дня для свежего новостного контента.

source: Optional: URL to your publication logo (JPEG or PNG format).
ru_ru: Необязательно: URL логотипа вашего издания (формат JPEG или PNG).

source: Used in the RSS <image> tag for feed branding.
ru_ru: Используется в теге <image> RSS для брендинга ленты.

source: Add <enclosure> tags with post images to each item.
ru_ru: Добавлять теги <enclosure> с изображениями к каждой записи.

source: Priority: OpenGraph image → Featured image → First content image.
ru_ru: Приоритет: OpenGraph изображение → Изображение записи → Первое изображение в контенте.

source: Automatically converts AVIF/WebP to JPEG format (Zen requirement).
ru_ru: Автоматически конвертирует AVIF/WebP в формат JPEG (требование Дзена).

source: Remove Teaser Paragraph
ru_ru: Удалить вводный абзац

source: Remove the first paragraph from <yandex:full-text> content.
ru_ru: Удалить первый абзац из контента <yandex:full-text>.

source: Useful if your first paragraph is a teaser/summary.
ru_ru: Полезно, если ваш первый абзац — это тизер или краткое содержание.

source: Strip all WordPress shortcodes from content before sending to feed.
ru_ru: Удалить все шорткоды WordPress из контента перед отправкой в ленту.

source: Recommended: Enabled, as shortcodes don't render in RSS readers.
ru_ru: Рекомендуется: Включено, так как шорткоды не отображаются в RSS-ридерах.

source: How many posts to include in the Channel feed (1-500).
ru_ru: Сколько записей включить в ленту канала (1-500).

source: Recommendation: At least 10 posts for initial feed setup.
ru_ru: Рекомендация: Минимум 10 записей для начальной настройки ленты.

source: Only include posts from the last N days (1-30).
ru_ru: Включать записи только за последние N дней (1-30).

source: Recommendation: 2-3 days for fresh content.
ru_ru: Рекомендация: 2-3 дня для свежего контента.

source: Avoid re-publishing old posts to Zen by keeping this value low.
ru_ru: Избегайте повторной публикации старых записей в Дзен, сохраняя это значение низким.

source: Full Content (content:encoded)
ru_ru: Полный контент (content:encoded)

source: Include full article HTML in <content:encoded> tag.
ru_ru: Включить полный HTML статьи в тег <content:encoded>.

source: Automatically converts images to JPEG, simplifies <figure> markup, and adds "Source" attribution.
ru_ru: Автоматически конвертирует изображения в JPEG, упрощает разметку <figure> и добавляет атрибуцию "Источник".

source: Recommended: Enabled for Zen Channel.
ru_ru: Рекомендуется: Включено для Дзен Канала.

source: "Related Posts" Block
ru_ru: Блок "Ещё по теме"

source: Insert "Ещё по теме:" (Related Posts) links into content.
ru_ru: Вставить ссылки "Ещё по теме:" в контент.

source: Displays up to 5 related posts from the same categories using <p><a> format (Zen-compliant).
ru_ru: Отображает до 5 похожих записей из тех же рубрик в формате <p><a> (совместимо с Дзен).

source: After which paragraph to insert the related posts block (1-10).
ru_ru: После какого абзаца вставить блок похожих записей (1-10).

source: Default: 2 (after second paragraph). If article has fewer paragraphs, block appears at the end.
ru_ru: По умолчанию: 2 (после второго абзаца). Если в статье меньше абзацев, блок появится в конце.

source: News Feed URL Slug
ru_ru: URL для ленты Новостей

source: Custom URL path for the News feed. Default: "zen-news"
ru_ru: Пользовательский путь URL для ленты новостей. По умолчанию: "zen-news"

source: Channel Feed URL Slug
ru_ru: URL для ленты Канала

source: Custom URL path for the Channel feed. Default: "zen-channel"
ru_ru: Пользовательский путь URL для ленты канала. По умолчанию: "zen-channel"

source: Second Custom Content Block
ru_ru: Второй кастомный блок контента

source: Enable Second Custom Block
ru_ru: Включить второй кастомный блок

source: Insert a second custom HTML block into the content.
ru_ru: Вставить второй кастомный HTML-блок в контент.

source: Second Custom HTML Content
ru_ru: HTML-контент второго блока

source: Second Custom Block Position
ru_ru: Позиция второго кастомного блока

source: After which paragraph to insert the second custom block.
ru_ru: После какого абзаца вставить второй кастомный блок.

source: Default: 5. If paragraph doesn't exist, block appears at the end.
ru_ru: По умолчанию: 5. Если абзац не существует, блок появится в конце.
